In [1]:
import numpy as np
import pandas as pd

## Pandas utility functions

To detect null values:

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(None)

True

The opposite ones also exists:

In [5]:
pd.notnull(None)

False

How they work with Series and dataframes

In [6]:
pd.isnull(pd.Series([1,np.nan,7]))

0    False
1     True
2    False
dtype: bool

In [7]:
pd.notnull(pd.Series([1,np.nan,7]))

0     True
1    False
2     True
dtype: bool

In [8]:
pd.isnull(pd.DataFrame({
        'Numbers':[1,2,6,8,np.nan],
        'Letters':['a','b',np.nan,None, 'c']
}  
))

   Numbers  Letters
0    False    False
1    False    False
2    False     True
3    False     True
4     True    False

## Pandas Operations with missing values

In [9]:
s = pd.Series([1,5,6,None, np.nan, 99])

In [10]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [11]:
s.isnull().sum()

2

In [12]:
s.notnull().sum()

4

In [13]:
s[s.notnull()]

0     1.0
1     5.0
2     6.0
5    99.0
dtype: float64

## Dropping null values

In [14]:
s.dropna()

0     1.0
1     5.0
2     6.0
5    99.0
dtype: float64

In [15]:
s

0     1.0
1     5.0
2     6.0
3     NaN
4     NaN
5    99.0
dtype: float64

## Dropping null values in DF

In [16]:
df = pd.DataFrame({
    'Column A':[1,np.nan,30,None],
    'Column B':[2,8,31,None],
    'Column C':[np.nan,9,32,100],
    'Column D':[5,8,34,110],
    
})

In [17]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [18]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [19]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

It drops all the rows

In [20]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

To drop just the column that has no null values:

In [21]:
df.dropna(axis=1)

   Column D
0         5
1         8
2        34
3       110

In [22]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [23]:
# it only drops the rows that are full of null values
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

You can also use the thresh parameter to indicate a threshold (a minimum number) of non-null values for the row/column to be kept:

In [24]:
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [25]:
df.dropna(thresh=3, axis=1)

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

## Filling null values

In [26]:
s

0     1.0
1     5.0
2     6.0
3     NaN
4     NaN
5    99.0
dtype: float64

In [27]:
s.fillna(0)

0     1.0
1     5.0
2     6.0
3     0.0
4     0.0
5    99.0
dtype: float64

In [28]:
s.fillna(s.mean())

0     1.00
1     5.00
2     6.00
3    27.75
4    27.75
5    99.00
dtype: float64

In [29]:
s.fillna(method='ffill')

0     1.0
1     5.0
2     6.0
3     6.0
4     6.0
5    99.0
dtype: float64

In [30]:
s.fillna(method='bfill')

0     1.0
1     5.0
2     6.0
3    99.0
4    99.0
5    99.0
dtype: float64

#### For dataframes

In [31]:
df.fillna(0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       0.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0       0.0     100.0       110

In [32]:
df.fillna(df['Column A'].mean())

   Column A  Column B  Column C  Column D
0       1.0       2.0      15.5         5
1      15.5       8.0       9.0         8
2      30.0      31.0      32.0        34
3      15.5      15.5     100.0       110

In [33]:
df['Column A'].fillna(df['Column A'].mean())

0     1.0
1    15.5
2    30.0
3    15.5
Name: Column A, dtype: float64

In [34]:
df.fillna(method='bfill', axis=0) #for columns way

   Column A  Column B  Column C  Column D
0       1.0       2.0       9.0         5
1      30.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

# Cleaning not-null values

In [35]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

## Finding unique values

In [36]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [37]:
df['Sex'].value_counts()

F    2
D    1
?    1
M    1
Name: Sex, dtype: int64

In [38]:
df['Sex'].replace('D','F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [39]:
df['Sex'].replace({'D':'F','?':'M'})

0    M
1    F
2    F
3    F
4    M
Name: Sex, dtype: object

In [40]:
df.replace({
    'Sex':{'D':'F','?':'M'},
    'Age':{290:29}
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   M   25

In [41]:
df[df['Age'] > 30].replace(df['Age'].mean())

  Sex  Age
3   D  290

In [42]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

## Duplicates

#### Series

In [43]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])

In [45]:
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [46]:
ambassadors.duplicated()

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [47]:
ambassadors.duplicated(keep='last')

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [49]:
ambassadors.duplicated(keep=False)

Gérard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [50]:
ambassadors.drop_duplicates()

Gérard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [52]:
ambassadors.drop_duplicates(keep='last')

Gérard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [53]:
ambassadors.drop_duplicates(keep=False)

Gérard Araud          France
Armando Varricchio     Italy
dtype: object

#### DataFrames

In [54]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [56]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [57]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [58]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [59]:
players.duplicated(subset=['Name'], keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [60]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [61]:
players.drop_duplicates(subset=['Name'])

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF

In [62]:
players.drop_duplicates(subset=['Name'], keep='last')

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

## Text handling

## Splitting columns

In [63]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [64]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 168.0+ bytes

In [66]:
df['Data'].str.split('_')

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [70]:
df = df['Data'].str.split('_', expand=True)

In [71]:
df.columns=['Year', 'Sex', 'Country', 'No Children']

In [72]:
df

    Year Sex Country No Children
0   1987   M     US            1
1  1990?   M      UK           1
2   1992   F      US           2
3  1970?   M      IT           1
4   1985   F    I  T           2

In [75]:
df['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [76]:
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [78]:
#to remove blank spaces
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [80]:
#to remove blank spaces
df['Country'].str.replace(' ','')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

As we said, replace and contains take regex patterns, which can make it easier to replace values in bulk:

In [81]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

C:\Users\User\anaconda3\envs\test\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  """Entry point for launching an IPython kernel.

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object